#include<stdio.h>

int main () {
    unsigned int hex; //要記得unsigned不然會不夠大，數字太長要記得加（要記得喔！不然會被當掉）
    scanf("%x", &hex);

    //16進位用%x
    //8進位用%o
    //10進位用%u

    //10000001 11000001 11100001 11110001(電腦會直接轉成二進位)

    int step1 = (hex >> 24) & 0xFF;//向左位移24格
    //00000000 00000000 00000000 100000001
    //00000000 00000000 00000000 11111111
    //00000000 00000000 00000000 100000001
    //1&1=1; 1&0=0; 0&0=0

    int step2 = (hex >> 16) & 0xFF;
    //00000000 00000000 100000001 11000001
    //00000000 00000000 00000000 11111111
    //00000000 00000000 00000000 11000001

    int step3 = (hex >> 8) & 0xFF;

    int step4 = hex & 0xFF;

    printf("%d.%d.%d.%d\n", step1, step2, step3, step4);//(電腦printf出來會直接轉成十進位制)


    return 0;
}